# RbsElecLoadsummaryDemandLoadParam Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsElecLoadsummaryDemandLoadParam Property
ParameterTypeId Class See Also
---
"Estimated Demand (VA)"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsElecLoadsummaryDemandLoadParam { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsElecLoadsummaryDemandLoadParam As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsElecLoadsummaryDemandLoadParam {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace